Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# Tip.0095.Title
source: Trigger Status Bar
de: Trigger-Statusleiste
ja: トリガーステータスバー
pt_br: Barra de status de gatilhos
ru: Строка состояния триггеров
zh_hans: 触发器状态栏

# Tip.0096.Body
source: Display session size directly in tab titles for convenient at-a-glance information.
de: Zeigen Sie die Sitzungsgröße direkt im Tab-Titel an, um praktische Informationen auf einen Blick zu erhalten.
ja: セッションサイズをタブタイトルに直接表示して、一目で情報を確認できるようにしましょう。
pt_br: Exiba o tamanho da sessão diretamente nos títulos das abas para uma informação prática à primeira vista.
ru: Отображайте размер сессии прямо в заголовках вкладок для удобной информации на первый взгляд.
zh_hans: 在标签页标题中直接显示会话大小，便于快速了解信息。

# Tip.0096.Title
source: Session Size in Tab
de: Sitzungsgröße im Tab
ja: タブ内のセッションサイズ
pt_br: Tamanho da sessão na aba
ru: Размер сессии во вкладке
zh_hans: 标签页中的会话大小

# Tip.0097.Body
source: Edit snippets in Advanced Paste by holding the ⌥ key, or open them in the composer with ⇧.
de: Bearbeiten Sie Snippets im Erweiterten Einfügen, indem Sie die ⌥-Taste gedrückt halten, oder öffnen Sie sie mit ⇧ im Composer.
ja: ⌥キーを押しながらにすると高度なペーストでスニペットを編集でき、⇧を押すとコンポーザーで開けます。
pt_br: Edite fragmentos no Advanced Paste mantendo pressionada a tecla ⌥, ou abra-os no compositor com ⇧.
ru: Редактируйте сниппеты в расширенной вставке, удерживая клавишу ⌥, или открывайте их в Композере с помощью ⇧.
zh_hans: 通过按住 ⌥ 键在高级粘贴功能中编辑片段，或使用 ⇧ 打开 composer编辑器来编辑。

# Tip.0097.Title
source: Advanced Snippet Editing
de: Erweiterte Snippet-Bearbeitung
ja: 高度なスニペット編集
pt_br: Edição avançada de fragmentos
ru: Расширенное редактирование сниппетов
zh_hans: 高级片段编辑功能

# Tip.0098.Body
source: Save your terminal logs in HTML format for enhanced readability and sharing capabilities.
de: Speichern Sie Ihre Terminalprotokolle im HTML-Format für bessere Lesbarkeit und einfachere Weitergabe.
ja: ターミナルのログをHTML形式で保存すると、読みやすさと共有のしやすさが向上します。
pt_br: Salve os logs do seu terminal em formato HTML para melhor legibilidade e recursos de compartilhamento.
ru: Сохраняйте журналы терминала в формате HTML для лучшей читаемости и удобства обмена.
zh_hans: 以 HTML 格式保存终端日志，便于阅读和分享。

# Tip.0098.Title
source: HTML Logs
de: HTML-Protokolle
ja: HTMLログ
pt_br: Logs em HTML
ru: Журналы HTML
zh_hans: HTML 日志

# Tip.0099.Body
source: Create and play back terminal recordings with ASCIICast logs, compatible with asciinema.
de: Erstellen und spielen Sie Terminalaufzeichnungen mit ASCIICast-Protokollen ab, kompatibel mit asciinema.
ja: ASCIICastログを使うと、ターミナルの録画を作成して再生できます。asciinemaと互換性があります。
pt_br: Crie e reproduza gravações do terminal com logs ASCIICast, compatíveis com o asciinema.
ru: Создавайте и воспроизводите записи терминала в формате ASCIICast, совместимом с asciinema.
zh_hans: 使用与 asciinema 兼容的 ASCIICast 日志创建并播放终端记录。

# Tip.0099.Title
source: ASCIICast Logs
de: ASCIICast-Protokolle
ja: ASCIICastログ
pt_br: Logs ASCIICast
ru: Журналы ASCIICast
zh_hans: ASCIICast 日志

# Tip.0100.Body
source: Include timestamps in your logs for better tracking and event correlation.
de: Fügen Sie Ihren Protokollen Zeitstempel hinzu, um die Nachverfolgung und Korrelation von Ereignissen zu verbessern.
ja: ログにタイムスタンプを含めると、追跡やイベントの相関がわかりやすくなります。
pt_br: Inclua marcações de tempo nos seus logs para melhor rastreamento e correlação de eventos.
ru: Добавляйте отметки времени в журналы для лучшего отслеживания и сопоставления событий.
zh_hans: 在日志中添加时间戳，以便更好地跟踪和关联事件。

# Tip.0100.Title
source: Timestamped Logs
de: Protokolle mit Zeitstempeln
ja: タイムスタンプ付きログ
pt_br: Logs com marcação de tempo
ru: Журналы с отметками времени
zh_hans: 带时间戳的日志

# Tip.0101.Body
source: Utilize LastPass or 1Password with the password manager by configuring it in the menu next to the search field.
de: Nutzen Sie LastPass oder 1Password mit dem Passwort-Manager, indem Sie ihn über das Menü neben dem Suchfeld konfigurieren.
ja: 検索フィールドの横にあるメニューで設定すると、パスワードマネージャーでLastPassや1Passwordを利用できます。
pt_br: Utilize o LastPass ou o 1Password com o cofre de senhas configurando-o no menu ao lado do campo de busca.
ru: Используйте LastPass или 1Password вместе с менеджером паролей, настроив это в меню рядом с полем поиска.
zh_hans: 通过在搜索字段旁边的菜单中配置密码管理器 LastPass 或 1Password，即可使用该工具。

# Tip.0102.Body
source: Access your password manager without authentication by adjusting the settings via the menu next to its search field.
de: Greifen Sie ohne Authentifizierung auf Ihren Passwort-Manager zu, indem Sie die Einstellungen über das Menü neben dessen Suchfeld anpassen.
ja: 検索フィールドの横にあるメニューで設定を調整すると、認証なしでパスワードマネージャーにアクセスできます。
pt_br: Acesse seu cofre de senhas sem autenticação ajustando os ajustes pelo menu ao lado do seu campo de busca.
ru: Открывайте доступ к менеджеру паролей без аутентификации, изменив настройки в меню рядом с его полем поиска.
zh_hans: 通过调整搜索字段旁边的菜单设置，无需认证即可访问密码管理器。

# Tip.0102.Title
source: Password Manager Access
de: Zugriff auf den Passwort-Manager
ja: パスワードマネージャーへのアクセス
pt_br: Acesso ao cofre de senhas
ru: Доступ к менеджеру паролей
zh_hans: 密码管理器访问方式

# Tip.0103.Body
source: Generate strong, secure passwords using the password manager’s new password generation feature.
de: Erzeugen Sie starke, sichere Passwörter mit der neuen Passwortgenerierungsfunktion des Passwort-Managers.
ja: パスワードマネージャーの新しいパスワード生成機能を使うと、強力で安全なパスワードを生成できます。
pt_br: Gere senhas fortes e seguras usando o novo recurso de geração de senhas do cofre de senhas.
ru: Создавайте надёжные пароли с помощью новой функции генерации паролей в менеджере паролей.
zh_hans: 利用密码管理器的新密码生成功能，创建强大且安全的密码。

# Tip.0103.Title
source: Password Generation
de: Passwortgenerierung
ja: パスワード生成
pt_br: Geração de senhas
ru: Генерация паролей
zh_hans: 密码生成

# Tip.0104.Body
source: Access tips of the day with the it2tip utility, a command line app. Enable it by installing shell integration and utilities.
de: Rufen Sie die Tipps des Tages mit dem Kommandozeilen-Dienstprogramm it2tip ab. Aktivieren Sie es, indem Sie Shell-Integration und Dienstprogramme installieren.
ja: コマンドラインアプリのit2tipユーティリティを使うと、今日のヒントにアクセスできます。シェル統合とユーティリティをインストールすると有効になります。
pt_br: Acesse as dicas do dia com o utilitário it2tip, um app de linha de comando. Ative-o instalando o Shell Integration e os utilitários.
ru: Получайте доступ к советам дня с помощью утилиты командной строки it2tip. Включите её, установив интеграцию с оболочкой и утилиты.
zh_hans: 使用命令行应用 it2tip，可以获取每日访问提示。通过安装shell集成工具即可启用该功能。

# Tip.0104.Title
source: it2tip Utility
de: it2tip-Dienstprogramm
ja: it2tipユーティリティ
pt_br: Utilitário it2tip
ru: Утилита it2tip
zh_hans: it2tip 工具

# Tip.0105.Body
source: Experience automatic shell integration when creating a login shell, removing the need for explicit setup on your Mac.
de: Erleben Sie automatische Shell-Integration beim Erstellen einer Login-Shell, ganz ohne dass eine ausdrückliche Einrichtung auf Ihrem Mac nötig ist.
ja: ログインシェルを作成すると自動的にシェル統合が行われ、Mac上で明示的なセットアップを行う必要がなくなります。
pt_br: Tenha o Shell Integration automático ao criar um login shell, eliminando a necessidade de configuração explícita no seu Mac.
ru: Получите автоматическую интеграцию с оболочкой при создании login shell без необходимости явной настройки на вашем Mac.
zh_hans: 在创建登录shell时，支持自动shell集成功能，无需在Mac上进行额外设置。

# Tip.0105.Title
source: Auto Shell Integration
de: Automatische Shell-Integration
ja: 自動シェル統合
pt_br: Shell Integration automático
ru: Автоматическая интеграция с оболочкой
zh_hans: 自动Shell集成

# Tip.0106.Body
source: Get detailed information about commands by ⌘-clicking on the command prompt.
de: Erhalten Sie detaillierte Informationen zu Befehlen, indem Sie bei gedrückter ⌘-Taste auf die Eingabeaufforderung klicken.
ja: コマンドプロンプトを⌘クリックすると、コマンドに関する詳細情報を取得できます。
pt_br: Obtenha informações detalhadas sobre comandos com ⌘-clique no prompt de comando.
ru: Получайте подробную информацию о командах, щёлкая с ⌘ по приглашению оболочки.
zh_hans: 通过⌘键点击命令提示符，可以获取关于命令的详细信息。

# Tip.0106.Title
source: Command Prompt Info
de: Informationen zur Eingabeaufforderung
ja: コマンドプロンプト情報
pt_br: Informações do prompt de comando
ru: Информация о приглашении оболочки
zh_hans: 命令提示符信息

# Tip.0107.Body
source: Use tmux integration for automatic key bindings that emulate tmux’s shortcuts, configurable via the Leader settings.
de: Nutzen Sie die tmux-Integration für automatische Tastenzuordnungen, die die Tastenkombinationen von tmux nachbilden und über die Leader-Einstellungen konfigurierbar sind.
ja: tmux統合を使うと、tmuxのショートカットをエミュレートする自動キーバインディングが利用でき、リーダーの設定で調整できます。
pt_br: Use o tmux integration para atalhos de teclado automáticos que emulam os atalhos do tmux, configuráveis pelos ajustes de Líder.
ru: Используйте интеграцию с tmux для автоматических привязок клавиш, эмулирующих сочетания клавиш tmux, настраиваемых через параметры лидера.
zh_hans: 使用 tmux 集成功能实现自动按键绑定，可模拟 tmux 快捷键，通过 Leader 设置进行配置。

# Tip.0108.Body
source: Sync your tmux paste buffer with the local clipboard for seamless integration (requires tmux 3.4).
de: Synchronisieren Sie Ihren tmux-Einfügepuffer mit der lokalen Zwischenablage für eine nahtlose Integration (erfordert tmux 3.4).
ja: tmuxのペーストバッファをローカルのクリップボードと同期し、シームレスな連携を実現します(tmux 3.4以降が必要です)。
pt_br: Sincronize o buffer de colagem do tmux com a área de transferência local para uma integração perfeita (requer tmux 3.4).
ru: Синхронизируйте буфер вставки tmux с локальным буфером обмена для полной интеграции (требуется tmux 3.4).
zh_hans: 将 tmux 粘贴缓冲区与本地剪贴板同步，实现无缝集成（需使用 tmux 3.4）。

# Tip.0108.Title
source: tmux Clipboard Mirroring
de: tmux-Zwischenablagen-Spiegelung
ja: tmuxクリップボードミラーリング
pt_br: Espelhamento da área de transferência do tmux
ru: Зеркалирование буфера обмена tmux
zh_hans: tmux 剪贴板镜像功能

# Tip.0109.Body
source: Enhance your editing in the Composer with multiple cursors, created using ^⇧-up/down or ⌥-drag.
de: Verbessern Sie Ihre Bearbeitung im Composer mit mehreren Cursor, die Sie mit ^⇧-nach oben/unten oder ⌥-Ziehen erstellen.
ja: ^⇧上/下または⌥ドラッグで作成できる複数カーソルを使うと、コンポーザーでの編集がさらに快適になります。
pt_br: Aprimore sua edição no Compositor com múltiplos cursores, criados usando ^⇧-cima/baixo ou ⌥-arrastar.
ru: Улучшите редактирование в Композере с помощью нескольких курсоров, создаваемых с помощью ^⇧-вверх/вниз или ⌥-перетаскивания.
zh_hans: 在 Composer 中，使用 ^⇧-上/下或 ⌥-拖拽功能添加多个光标，以改进编辑体验。

# Tip.0109.Title
source: Multi-Cursor in Composer
de: Mehrere Cursor im Composer
ja: コンポーザーでのマルチカーソル
pt_br: Múltiplos cursores no Compositor
ru: Несколько курсоров в Композере
zh_hans: Composer 中的多光标功能

# Tip.0110.Body
source: Move content from the Composer to the Advanced Paste window with ⌥⌘V for additional editing options.
de: Verschieben Sie Inhalte mit ⌥⌘V vom Eingabefenster in das Fenster „Erweitertes Einfügen“, um weitere Bearbeitungsoptionen zu nutzen.
ja: ⌥⌘Vを使うと、コンポーザーの内容を高度なペーストウィンドウに移動して、さらに編集オプションを利用できます。
pt_br: Mova conteúdo do Compositor para a janela do Advanced Paste com ⌥⌘V para opções de edição adicionais.
ru: Перемещайте содержимое из Композера в окно расширенной вставки с помощью ⌥⌘V для дополнительных параметров редактирования.
zh_hans: 使用 ⌥⌘V 将 Composer 中的内容移动到高级粘贴窗口，以获得更多编辑选项。

# Tip.0110.Title
source: Advanced Paste from Composer
de: Erweitertes Einfügen aus dem Eingabefenster
ja: コンポーザーからの高度なペースト
pt_br: Advanced Paste a partir do Compositor
ru: Расширенная вставка из Композера
zh_hans: 从 Composer 进行高级粘贴操作

# Tip.0111.Body
source: Search within the Composer using ⌘F to quickly find specific text.
de: Durchsuchen Sie das Eingabefenster mit ⌘F, um bestimmten Text schnell zu finden.
ja: ⌘Fを使うと、コンポーザー内を検索して特定のテキストをすばやく見つけられます。
pt_br: Busque dentro do Compositor usando ⌘F para encontrar rapidamente um texto específico.
ru: Ищите в Композере с помощью ⌘F, чтобы быстро найти нужный текст.
zh_hans: 使用 ⌘F 在 Composer 中搜索，以便快速找到特定文本。

# Tip.0111.Title
source: Composer Search
de: Suche im Eingabefenster
ja: コンポーザー検索
pt_br: Busca no Compositor
ru: Поиск в Composer
zh_hans: Composer 搜索

# Tip.0112.Body
source: Adjust the Composer’s height to suit your needs by dragging its bottom edge.
de: Passen Sie die Höhe des Eingabefensters an Ihre Bedürfnisse an, indem Sie seinen unteren Rand ziehen.
ja: 下端をドラッグして、コンポーザーの高さを好みに合わせて調整できます。
pt_br: Ajuste a altura do Compositor conforme suas necessidades arrastando sua borda inferior.
ru: Настройте высоту Composer под свои нужды, перетаскивая его нижний край.
zh_hans: 通过拖动 Composer 的底部边缘，调整其高度以符合需求。

# Tip.0112.Title
source: Resize Composer
de: Größe des Eingabefensters ändern
ja: コンポーザーのサイズ変更
pt_br: Redimensionar Compositor
ru: Изменение размера Composer
zh_hans: 调整 Composer 大小

# Tip.0113.Body
source: Learn more about your commands by ⌘-clicking in the Composer to open them in explainshell.com.
de: Erfahren Sie mehr über Ihre Befehle, indem Sie im Eingabefenster ⌘-klicken, um sie in explainshell.com zu öffnen.
ja: コンポーザー内で⌘クリックすると、explainshell.comでコマンドの詳細を確認できます。
pt_br: Saiba mais sobre seus comandos com ⌘-clique no Compositor para abri-los em explainshell.com.
ru: Узнайте больше о своих командах, щёлкнув с зажатой ⌘ в Composer, чтобы открыть их в explainshell.com.
zh_hans: 通过 ⌘-点击 Composer 中的命令，可在 explainshell.com 中查看相关说明以了解更多信息。

# Tip.0113.Title
source: Explain Command
de: Befehl erklären
ja: コマンドを説明
pt_br: Explicar comando
ru: Объяснение команды
zh_hans: 解释命令

# Tip.0114.Body
source: Quickly send and remove commands in the Composer using ⌥⇧-enter.
de: Senden und entfernen Sie Befehle im Eingabefenster schnell mit ⌥⇧-Eingabe.
ja: ⌥⇧-Enterを使うと、コンポーザーでコマンドをすばやく送信して削除できます。
pt_br: Envie e remova rapidamente comandos no Compositor usando ⌥⇧-enter.
ru: Быстро отправляйте и удаляйте команды в Composer с помощью ⌥⇧-Enter.
zh_hans: 使用 ⌥⇧-Enter 可快速在 Composer 中发送并删除命令。

# Tip.0114.Title
source: Quick Command Send
de: Schnelles Senden von Befehlen
ja: コマンドのクイック送信
pt_br: Envio rápido de comandos
ru: Быстрая отправка команды
zh_hans: 快速命令发送功能

# Tip.0115.Body
source: Queue up a command in the Composer to be sent after the current command finishes with ⌥-Enter.
de: Reihen Sie mit ⌥-Eingabe einen Befehl im Eingabefenster ein, der gesendet wird, sobald der aktuelle Befehl abgeschlossen ist.
ja: ⌥-Enterを使うと、現在のコマンドが終了した後に送信されるコマンドをコンポーザーにキューイングできます。
pt_br: Coloque um comando na fila no Compositor para ser enviado depois que o comando atual terminar, com ⌥-Enter.
ru: Поставьте команду в очередь в Composer, чтобы она была отправлена после завершения текущей команды, с помощью ⌥-Enter.
zh_hans: 使用 ⌥-Enter 可将 Composer 中的命令排队，在当前命令执行完成后发送。

# Tip.0115.Title
source: Queue Commands
de: Befehle in eine Warteschlange einreihen
ja: コマンドをキューイング
pt_br: Comandos em fila
ru: Очередь команд
zh_hans: 队列命令功能

# Tip.0116.Body
source: Reposition the Tip of the Day window conveniently on your screen, as it is now draggable.
de: Positionieren Sie das Fenster „Tipp des Tages“ bequem auf Ihrem Bildschirm, denn es lässt sich jetzt per Ziehen verschieben.
ja: 「今日のヒント」ウィンドウはドラッグできるようになったので、画面上の好きな位置に移動できます。
pt_br: Reposicione a janela Dica do dia convenientemente na sua tela, pois agora ela pode ser arrastada.
ru: Удобно перемещайте окно «Совет дня» по экрану, теперь его можно перетаскивать.
zh_hans: 每日提示窗格现在可拖拽至屏幕任意位置，便于调整布局。

# Tip.0116.Title
source: Draggable Tip Window
de: Verschiebbares Tipp-Fenster
ja: ドラッグ可能なヒントウィンドウ
pt_br: Janela de dica arrastável
ru: Перетаскиваемое окно советов
zh_hans: 可拖动的提示窗口

# Tip.0117.Body
source: iTerm2 now has an AI Chat feature! Use “Window > AI Chats” or “Edit > Explain Output with AI”. The assistant can interact with your terminal (with your permission) and explain command output, adding annotations right in the terminal.
de: iTerm2 verfügt jetzt über eine KI-Chat-Funktion! Verwenden Sie „Fenster > KI-Chats“ oder „Bearbeiten > Ausgabe mit KI erklären“. Der Assistent kann (mit Ihrer Erlaubnis) mit Ihrem Terminal interagieren und die Befehlsausgabe erklären, indem er Anmerkungen direkt im Terminal hinzufügt.
ja: iTerm2にAIチャット機能が追加されました！「ウィンドウ > AIチャット」または「編集 > AIで出力を説明」を使ってみましょう。アシスタントは（許可があれば）ターミナルと対話し、コマンドの出力を説明したり、ターミナル内に直接注釈を追加したりできます。
pt_br: O iTerm2 agora tem um recurso de AI Chat! Use “Window > AI Chats” ou “Edit > Explain Output with AI”. O assistente pode interagir com o seu terminal (com sua permissão) e explicar a saída de comandos, adicionando anotações diretamente no terminal.
ru: Теперь в iTerm2 есть функция AI Chat! Используйте «Окно > Чаты ИИ» или «Правка > Объяснить вывод с помощью ИИ». Ассистент может взаимодействовать с вашим терминалом (с вашего разрешения) и объяснять вывод команд, добавляя аннотации прямо в терминале.
zh_hans: iTerm2现在拥有AI聊天功能！使用“窗口 > AI聊天”或“编辑 > 用AI解释输出”。在您的允许下，助手可以与终端互动，并在终端中直接添加注释来解释命令输出。

# Tip.0117.Title
source: AI Chat
de: KI-Chat
ja: AIチャット
ru: ИИ-чат
zh_hans: AI聊天

# Tip.0118.Body
source: You can configure a profile to be a web browser! In “Settings > Profiles > General”, set “Profile Type” to “Web Browser”. Key bindings, smart selection, and the password manager all work in browser sessions.
de: Sie können ein Profil als Webbrowser konfigurieren! Stellen Sie unter „Einstellungen > Profile > Allgemein“ den „Profiltyp“ auf „Webbrowser“. Tastenkombinationen, intelligente Auswahl und der Passwort-Manager funktionieren auch in Browser-Sitzungen.
ja: プロファイルをウェブブラウザとして設定できます！「設定 > プロファイル > 一般」で「プロファイルタイプ」を「ウェブブラウザ」に設定してください。キーバインド、スマート選択、パスワードマネージャーはすべてブラウザセッションでも動作します。
pt_br: Você pode configurar um perfil para ser um navegador da web! Em “Settings > Profiles > General”, defina “Profile Type” como “Web Browser”. Atalhos de teclado, seleção inteligente e o cofre de senhas funcionam todos em sessões de navegador.
ru: Вы можете настроить профиль так, чтобы он работал как веб-браузер! В разделе «Настройки > Профили > Общие» установите для параметра «Тип профиля» значение «Веб-браузер». Привязки клавиш, умный выбор и менеджер паролей работают и в сеансах браузера.
zh_hans: 您可以配置配置文件为网页浏览器！在“设置 > 配置文件 > 通用”中，将“配置文件类型”设置为“网页浏览器”。按键绑定、智能选取以及密码管理器均可在浏览器会话中正常使用。

# Tip.0118.Title
source: Web Browser Profiles
de: Webbrowser-Profile
ja: ウェブブラウザプロファイル
pt_br: Perfis de navegador da web
ru: Профили веб-браузера
zh_hans: 网页浏览器配置文件

# Tip.0119.Body
source: Timestamps can now be shown next to terminal content instead of overlapping. Configure it in “Settings > Profiles > Session > Timestamps”. Right-click on any line and select “Set Baseline for Relative Timestamps” to see time elapsed between lines.
de: Zeitstempel können jetzt neben dem Terminalinhalt angezeigt werden, statt sich zu überlappen. Konfigurieren Sie dies unter „Einstellungen > Profile > Sitzung > Zeitstempel“. Klicken Sie mit der rechten Maustaste auf eine beliebige Zeile und wählen Sie „Basislinie für relative Zeitstempel festlegen“, um die verstrichene Zeit zwischen Zeilen zu sehen.
ja: タイムスタンプをターミナルの内容に重ねずに、横に並べて表示できるようになりました。「設定 > プロファイル > セッション > タイムスタンプ」で設定してください。任意の行を右クリックし、「相対タイムスタンプの基準点を設定」を選択すると、行間の経過時間を確認できます。
pt_br: As marcações de tempo agora podem ser exibidas ao lado do conteúdo do terminal em vez de sobrepostas. Configure isso em “Settings > Profiles > Session > Timestamps”. Clique com o botão direito em qualquer linha e selecione “Set Baseline for Relative Timestamps” para ver o tempo decorrido entre as linhas.
ru: Теперь отметки времени можно отображать рядом с содержимым терминала, а не поверх него. Настройте это в разделе «Настройки > Профили > Сеанс > Отметки времени». Щёлкните правой кнопкой мыши на любой строке и выберите «Задать точку отсчёта для относительных отметок времени», чтобы увидеть время, прошедшее между строками.
zh_hans: 时间戳现在可以显示在终端内容旁边，不会重叠。在“设置 > 配置文件 > 会话 > 时间戳”中进行配置。点击任意行右键，选择“为相对时间戳设置基准”，即可查看各行之间的时间间隔。

# Tip.0119.Title
source: Adjacent Timestamps
de: Angrenzende Zeitstempel
ja: 隣接タイムスタンプ
pt_br: Marcações de tempo adjacentes
ru: Отметки времени рядом
zh_hans: 相邻的时间戳

# Tip.0120.Body
source: Select a block of JSON text and choose “Edit > Replace Selection > Replace with Pretty-Printed JSON” to make it readable. Perfect for debugging API responses and log files.
de: Markieren Sie einen JSON-Textblock und wählen Sie „Bearbeiten > Auswahl ersetzen > Mit formatiertem JSON ersetzen“, um ihn lesbar zu machen. Perfekt zum Debuggen von API-Antworten und Protokolldateien.
ja: JSONテキストのブロックを選択し、「編集 > 選択範囲を置換 > 整形されたJSONに置換」を選ぶと読みやすくなります。APIレスポンスやログファイルのデバッグに最適です。
pt_br: Selecione um bloco de texto JSON e escolha “Edit > Replace Selection > Replace with Pretty-Printed JSON” para torná-lo legível. Perfeito para depurar respostas de API e arquivos de log.
ru: Выделите блок текста JSON и выберите «Правка > Заменить выделенное > Заменить отформатированным JSON», чтобы сделать его удобочитаемым. Отлично подходит для отладки ответов API и файлов журналов.
zh_hans: 选择一段JSON文本，然后选择“编辑 > 替换选中内容 > 用格式化JSON替换”，使其更易于阅读。非常适合调试API响应和日志文件。

# Tip.0120.Title
source: Pretty-Print JSON
de: JSON formatieren
ja: JSONを整形
pt_br: Formatar JSON
ru: Форматирование JSON
zh_hans: 格式化JSON

# Tip.0121.Body
source: Open Quickly (⇧⌘O) is now a command palette! Just type the name of a menu item to activate it.
de: „Schnell öffnen“ (⇧⌘O) ist jetzt eine Befehlspalette! Geben Sie einfach den Namen eines Menüpunkts ein, um ihn zu aktivieren.
ja: 「すばやく開く」（⇧⌘O）がコマンドパレットになりました！メニュー項目の名前を入力するだけで実行できます。
pt_br: O Open Quickly (⇧⌘O) agora é uma paleta de comandos! Basta digitar o nome de um item de menu para ativá-lo.
ru: Быстрое открытие (⇧⌘O) теперь работает как палитра команд! Просто введите название пункта меню, чтобы активировать его.
zh_hans: “快速打开”（⇧⌘O）现在是一个命令面板！只需输入菜单项名称即可激活它。

# Tip.0121.Title
source: Command Palette
de: Befehlspalette
ja: コマンドパレット
pt_br: Paleta de comandos
ru: Палитра команд
zh_hans: 命令面板

# Tip.0122.Body
source: Enable “Settings > Profiles > Terminal > Click on a path in a shell prompt to open Navigator” to navigate your filesystem by clicking on paths in your prompt. Requires Shell Integration.
de: Aktivieren Sie „Einstellungen > Profile > Terminal > Klick auf einen Pfad in einer Shell-Eingabeaufforderung öffnet Navigator“, um Ihr Dateisystem durch Klicken auf Pfade in Ihrer Eingabeaufforderung zu durchsuchen. Erfordert Shell-Integration.
ja: 「設定 > プロファイル > ターミナル > シェルプロンプト内のパスをクリックしてナビゲーターを開く」を有効にすると、プロンプト内のパスをクリックしてファイルシステムを移動できます。シェル統合が必要です。
pt_br: Ative “Settings > Profiles > Terminal > Click on a path in a shell prompt to open Navigator” para navegar pelo seu sistema de arquivos clicando em caminhos no seu prompt. Requer o Shell Integration.
ru: Включите «Настройки > Профили > Терминал > Щёлкать по пути в приглашении оболочки, чтобы открыть Навигатор», чтобы перемещаться по файловой системе, щёлкая по путям в приглашении. Требует интеграции с оболочкой.
zh_hans: 启用“设置 > 配置文件 > 终端 > 在shell提示符中点击路径以打开导航器”功能，通过点击提示符中的路径来浏览文件系统。需要Shell集成。

# Tip.0122.Title
source: Click Paths in Shell Prompts
de: Pfade in Shell-Eingabeaufforderungen anklicken
ja: シェルプロンプト内のパスをクリック
pt_br: Clicar em caminhos em prompts de shell
ru: Щелчок по путям в приглашении оболочки
zh_hans: 在shell提示符中点击路径
